app/controllers/flavours_controller.rb

SELECT "flavours".* FROM "flavours"
---
  def index
    @flavours = Flavour.all

INSERT INTO "flavours" ("name", "mood", "personality", "transport", "scenariotube", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["mood", "Sad"], ["personality", "4"], ["transport", "BMW"], ["scenariotube", ""], ["created_at", "2015-05-14 15:22:44.765806"], ["updated_at", "2015-05-14 15:22:44.765806"]]
---
  def create
    @flavour = Flavour.new(flavour_params)

    respond_to do |format|
      if @flavour.save

DELETE FROM "flavours" WHERE "flavours"."id" = ?  [["id", 4]]
---
  def destroy
    @flavour.destroy

SELECT  "flavours".* FROM "flavours" WHERE "flavours"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_flavour
      @flavour = Flavour.find(params[:id])